espressif/esp-dev-kits/examples/esp-dualkey/examples/factory_demo/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_TUSB_VID=0x303A
CONFIG_TUSB_PID=0x8000
CONFIG_DEEP_SLEEP_TIMEOUT_S=1200
CONFIG_APP_NETWORK_PROV_NAME_PREFIX="M_Key"
CONFIG_ESP_RMAKER_ASSISTED_CLAIM=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_LPCLK_SEL_EXT_32K_XTAL=y
CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP=y
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_RTC_CLK_SRC_EXT_CRYS=y
CONFIG_RTC_CLK_CAL_CYCLES=1024
CONFIG_ESP_PHY_MAC_BB_PD=y
CONFIG_ESP_PHY_RF_CAL_NONE=y
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=2000
CONFIG_BUTTON_LONG_PRESS_HOLD_SERIAL_TIME_MS=300
CONFIG_MATRIX_COLS=2
CONFIG_MATRIX_LED_COUNT=2
CONFIG_ENABLE_RGB_MATRIX_TYPING_HEATMAP=y
CONFIG_ENABLE_RGB_MATRIX_BREATHING=y
CONFIG_ENABLE_RGB_MATRIX_PIXEL_FLOW=y
CONFIG_ENABLE_RGB_MATRIX_RIVERFLOW=y
